lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_analog.c
static uint8_t saadc_wait_event(uintptr_t base, uintptr_t event_off, uint32_t spin_limit)
{
    while (spin_limit-- > 0U) {
        if (*regptr(base, event_off) != 0U) {
            return 1U;
        }
        __NOP();
    }

    return (*regptr(base, event_off) != 0U) ? 1U : 0U;
}

static void saadc_stop_and_disable(uintptr_t base)
{
    *regptr(base, SAADC_TASKS_STOP) = 1UL;
    (void)saadc_wait_event(base, SAADC_EVENTS_STOPPED, kSaadcStopSpinLimit);
    *regptr(base, SAADC_ENABLE) = SAADC_ENABLE_DISABLED;
}

static void gpio_write_raw(uint8_t port, uint8_t pin, uint8_t high)
{
    NRF_GPIO_Type* gpio = gpio_for_port(port);
    if (gpio == 0 || pin > 31U) {
        return;
    }

    const uint32_t bit = (1UL << pin);
    gpio->DIRSET = bit;
    if (high != 0U) {
        gpio->OUTSET = bit;
    } else {
        gpio->OUTCLR = bit;
    }
}

static uint32_t soft_pwm_period_us_for_frequency(uint32_t hz);

static uint32_t dppi_config_value(uint8_t channel)
{
    return ((uint32_t)channel & 0xFFUL) | (1UL << 31U);
}

static uint8_t timer_pwm_slot_dppi_channel(uint8_t slot)
{
    return slot;
}

static uint8_t pwm_pin_supports_timer_output(uint8_t index)
{
    return (index < 6U) ? 1U : 0U;
}

static uint8_t pwm_pin_requests_custom_frequency(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT) {
        return 0U;
    }
    return (g_pwm_pin_frequency_hz[index] != 0UL) ? 1U : 0U;
}

static uint32_t pwm_pin_effective_frequency_hz(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT) {
        return g_analog_write_frequency_hz;
    }
    if (g_pwm_pin_frequency_hz[index] != 0UL) {
        return g_pwm_pin_frequency_hz[index];
    }
    return g_analog_write_frequency_hz;
}

static uint32_t soft_pwm_period_us_for_pin(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT || g_pwm_pin_frequency_hz[index] == 0UL) {
        return g_soft_pwm_period_us;
    }
    return soft_pwm_period_us_for_frequency(g_pwm_pin_frequency_hz[index]);
}

static void soft_pwm_update_channel(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT || g_pwm_countertop == 0U) {
        return;
    }

    const uint32_t soft_period_us = soft_pwm_period_us_for_pin(index);
    uint32_t on_time_us =
        ((uint32_t)g_pwm_pin_pulse[index] * soft_period_us + (g_pwm_countertop / 2U)) /
        (uint32_t)g_pwm_countertop;

    if (on_time_us == 0UL) {
        on_time_us = 1UL;
    } else if (on_time_us >= soft_period_us) {
        on_time_us = soft_period_us - 1UL;
    }

    g_soft_pwm_on_time_us[index] = on_time_us;
}

static uint8_t timer_pwm_compute_timing(uint32_t target_hz,
                                        uint8_t* prescaler,
                                        uint32_t* period_ticks)
{
    if (prescaler == 0 || period_ticks == 0 || target_hz == 0UL) {
        return 0U;
    }

    uint32_t best_error = 0xFFFFFFFFUL;
    uint8_t best_prescaler = 0U;
    uint32_t best_period_ticks = 0U;
    uint8_t found = 0U;

    for (uint8_t p = 0U; p <= 9U; ++p) {
        const uint32_t timer_clk = 16000000UL >> p;
        if (timer_clk == 0UL) {
            continue;
        }

        uint32_t ticks = (timer_clk + (target_hz / 2UL)) / target_hz;
        if (ticks < 2UL) {
            ticks = 2UL;
        }

        const uint32_t actual_hz = timer_clk / ticks;
        const uint32_t error =
            (actual_hz >= target_hz) ? (actual_hz - target_hz) : (target_hz - actual_hz);

        if (!found || error < best_error ||
            (error == best_error && p < best_prescaler)) {
            found = 1U;
            best_error = error;
            best_prescaler = p;
            best_period_ticks = ticks;
            if (error == 0UL) {
                break;
            }
        }
    }

    if (!found || best_period_ticks < 2UL) {
        return 0U;
    }

    *prescaler = best_prescaler;
    *period_ticks = best_period_ticks;
    return 1U;
}

static uint8_t timer_pwm_ensure_slot(uint8_t index, uint8_t* slot_out)
{
    if (slot_out == 0 || pwm_pin_supports_timer_output(index) == 0U) {
        return 0U;
    }

    if (g_pwm_pin_timer_slot[index] != ANALOG_PWM_NO_SLOT) {
        *slot_out = g_pwm_pin_timer_slot[index];
        return 1U;
    }

    for (uint8_t slot = 0U; slot < ANALOG_TIMER_PWM_SLOT_COUNT; ++slot) {
        if (g_timer_pwm_slot_owner[slot] != ANALOG_PWM_NO_PIN) {
            continue;
        }

        uint8_t gpiote_channel = ANALOG_PWM_NO_CHANNEL;
        if (nrf54l15_gpiote20_acquire_task_channel(&gpiote_channel) == 0U) {
            continue;
        }

        g_timer_pwm_slot_owner[slot] = index;
        g_timer_pwm_slot_gpiote_channel[slot] = gpiote_channel;
        g_pwm_pin_timer_slot[index] = slot;
        *slot_out = slot;
        return 1U;
    }

    return 0U;
}

static uint32_t timer_pwm_capture_phase_ticks(uintptr_t timer_base,
                                              uint32_t period_ticks)
{
    *regptr(timer_base,
            TIMER_TASKS_CAPTURE0 +
                ((uintptr_t)ANALOG_TIMER_PWM_CAPTURE_CHANNEL * TIMER_TASKS_CAPTURE_STRIDE)) = 1U;

    uint32_t phase_ticks =
        *regptr(timer_base,
                TIMER_CC0 + ((uintptr_t)ANALOG_TIMER_PWM_CAPTURE_CHANNEL * TIMER_CC_STRIDE));
    if (period_ticks != 0UL && phase_ticks >= period_ticks) {
        phase_ticks = 0UL;
    }
    return phase_ticks;
}

static void timer_pwm_force_live_phase(uint8_t slot,
                                       uint32_t high_ticks)
{
    if (slot >= ANALOG_TIMER_PWM_SLOT_COUNT ||
        g_timer_pwm_slot_owner[slot] == ANALOG_PWM_NO_PIN ||
        g_timer_pwm_slot_active[slot] == 0U) {
        return;
    }

    const uint8_t gpiote_channel = g_timer_pwm_slot_gpiote_channel[slot];
    if (gpiote_channel == ANALOG_PWM_NO_CHANNEL) {
        return;
    }

    const uintptr_t timer_base = k_timer_pwm_base[slot];
    const uint32_t period_ticks = g_timer_pwm_slot_period_ticks[slot];
    if (period_ticks == 0UL) {
        return;
    }

    const uint32_t phase_ticks = timer_pwm_capture_phase_ticks(timer_base, period_ticks);
    const uintptr_t gpiote_task =
        ((phase_ticks + 1UL) < high_ticks) ? GPIOTE_TASKS_SET0 : GPIOTE_TASKS_CLR0;
    *regptr(k_timer_pwm_gpiote_base,
            gpiote_task + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 1U;
}

static void timer_pwm_stop_slot(uint8_t slot)
{
    if (slot >= ANALOG_TIMER_PWM_SLOT_COUNT ||
        g_timer_pwm_slot_owner[slot] == ANALOG_PWM_NO_PIN) {
        return;
    }

    const uint8_t dppi_channel = timer_pwm_slot_dppi_channel(slot);
    const uintptr_t timer_base = k_timer_pwm_base[slot];
    const uint8_t gpiote_channel = g_timer_pwm_slot_gpiote_channel[slot];

    *regptr(timer_base, TIMER_TASKS_STOP) = 1U;
    *regptr(timer_base, TIMER_SHORTS) = 0U;
    *regptr(timer_base, TIMER_SUBSCRIBE_START) = 0U;
    *regptr(timer_base, TIMER_SUBSCRIBE_CLEAR) = 0U;
    *regptr(timer_base, TIMER_PUBLISH_COMPARE0) = 0U;
    *regptr(timer_base, TIMER_PUBLISH_COMPARE0 + TIMER_PUBLISH_COMPARE_STRIDE) = 0U;
    *regptr(timer_base, TIMER_PUBLISH_COMPARE0 + (2UL * TIMER_PUBLISH_COMPARE_STRIDE)) = 0U;
    *regptr(timer_base, TIMER_EVENTS_COMPARE0) = 0U;
    *regptr(timer_base, TIMER_EVENTS_COMPARE0 + TIMER_EVENTS_COMPARE_STRIDE) = 0U;
    *regptr(timer_base, TIMER_EVENTS_COMPARE0 + (2UL * TIMER_EVENTS_COMPARE_STRIDE)) = 0U;
    *regptr(k_timer_pwm_dppic_base, DPPIC_CHENCLR) = (1UL << dppi_channel);

    if (gpiote_channel != ANALOG_PWM_NO_CHANNEL) {
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_SUBSCRIBE_OUT0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 0U;
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_SUBSCRIBE_SET0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 0U;
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_SUBSCRIBE_CLR0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 0U;
    }

    g_timer_pwm_slot_pending_update[slot] = 0U;
    g_timer_pwm_slot_active[slot] = 0U;
}

static uint8_t timer_pwm_hold_pin_static(uint8_t index, uint8_t high)
{
    uint8_t port = 0U;
    uint8_t pin = 0U;
    if (index >= ANALOG_PWM_PIN_COUNT) {
        return 0U;
    }

    const uint8_t slot = g_pwm_pin_timer_slot[index];
    if (slot == ANALOG_PWM_NO_SLOT || slot >= ANALOG_TIMER_PWM_SLOT_COUNT) {
        return 0U;
    }
    if (resolve_pwm_gpio(index, &port, &pin) == 0U) {
        return 0U;
    }

    timer_pwm_stop_slot(slot);
    gpio_write_raw(port, pin, high);
    g_pwm_pin_software[index] = 0U;
    g_soft_pwm_on_time_us[index] = 0UL;
    g_soft_pwm_output_high[index] = high;
    return 1U;
}

