lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_analog.c
    const uint8_t shift = (uint8_t)(to_bits - from_bits);
    if (shift >= 31U) {
        return 0x7FFFFFFFUL;
    }
    const uint32_t shifted = value << shift;
    if ((shifted >> shift) != value) {
        return 0x7FFFFFFFUL;
    }
    return shifted;
}

static int saadc_sample_pin_once(uint8_t port, uint8_t pin, uint8_t resolution_bits)
{
    const uintptr_t base = (uintptr_t)NRF_SAADC;

    gpio_prepare_analog_input(port, pin);

    *regptr(base, SAADC_ENABLE) = SAADC_ENABLE_DISABLED;
    *regptr(base, SAADC_OVERSAMPLE) = SAADC_OVERSAMPLE_BYPASS;
    *regptr(base, SAADC_NOISESHAPE) = SAADC_NOISESHAPE_DISABLED;
    *regptr(base, SAADC_SAMPLERATE) = (SAADC_SAMPLERATE_MODE_Task << SAADC_SAMPLERATE_MODE_Pos);

    for (uint8_t ch = 0; ch < 8U; ++ch) {
        const uintptr_t off = (uintptr_t)ch * SAADC_CH_STRIDE;
        *regptr(base, SAADC_CH_PSELP + off) =
            ((uint32_t)SAADC_CH_PSELP_CONNECT_NC << SAADC_CH_PSELP_CONNECT_Pos);
        *regptr(base, SAADC_CH_PSELN + off) =
            ((uint32_t)SAADC_CH_PSELN_CONNECT_NC << SAADC_CH_PSELN_CONNECT_Pos);
        *regptr(base, SAADC_CH_CONFIG + off) = 0;
    }

    uint32_t cfg = 0;
    cfg |= (7UL << SAADC_CH_CONFIG_GAIN_Pos);      // Gain = 2/8
    cfg |= (SAADC_CH_CONFIG_REFSEL_Internal << SAADC_CH_CONFIG_REFSEL_Pos);
    cfg |= (SAADC_CH_CONFIG_MODE_SE << SAADC_CH_CONFIG_MODE_Pos);
    cfg |= (159UL << SAADC_CH_CONFIG_TACQ_Pos);
    cfg |= (4UL << SAADC_CH_CONFIG_TCONV_Pos);

    *regptr(base, SAADC_CH_PSELP) = make_psel(port, pin);
    *regptr(base, SAADC_CH_PSELN) =
        ((uint32_t)SAADC_CH_PSELN_CONNECT_NC << SAADC_CH_PSELN_CONNECT_Pos);
    *regptr(base, SAADC_CH_CONFIG) = cfg;

    uint8_t resolution_sel = 2U;
    if (resolution_bits <= 8U) {
        resolution_sel = 0U;
    } else if (resolution_bits <= 10U) {
        resolution_sel = 1U;
    } else if (resolution_bits <= 12U) {
        resolution_sel = 2U;
    } else {
        resolution_sel = 3U;
    }

    *regptr(base, SAADC_RESOLUTION) = resolution_sel;

    g_saadc_sample = 0;
    *regptr(base, SAADC_RESULT_PTR) = (uint32_t)(uintptr_t)&g_saadc_sample;
    // MAXCNT is in bytes (one SAADC sample = 2 bytes).
    *regptr(base, SAADC_RESULT_MAXCNT) = 2UL;

    *regptr(base, SAADC_EVENTS_STARTED) = 0;
    *regptr(base, SAADC_EVENTS_END) = 0;
    *regptr(base, SAADC_EVENTS_STOPPED) = 0;
    *regptr(base, SAADC_EVENTS_CALDONE) = 0;

#if defined(NRF54L15_CLEAN_POWER_LOW)
    delayMicroseconds(kSaadcLowPowerSettleUs);
#endif
    *regptr(base, SAADC_ENABLE) = SAADC_ENABLE_ENABLED;
    *regptr(base, SAADC_TASKS_CALIBRATE) = 1UL;
    if (!saadc_wait_event(base, SAADC_EVENTS_CALDONE, kSaadcCalibrateSpinLimit)) {
        saadc_stop_and_disable(base);
        return -1;
    }
    *regptr(base, SAADC_EVENTS_CALDONE) = 0;

    *regptr(base, SAADC_TASKS_START) = 1UL;
    if (!saadc_wait_event(base, SAADC_EVENTS_STARTED, kSaadcStartSpinLimit)) {
        saadc_stop_and_disable(base);
        return -1;
    }

    *regptr(base, SAADC_TASKS_SAMPLE) = 1UL;
    if (!saadc_wait_event(base, SAADC_EVENTS_END, kSaadcSampleSpinLimit)) {
        saadc_stop_and_disable(base);
        return -1;
    }

    *regptr(base, SAADC_TASKS_STOP) = 1UL;
    if (!saadc_wait_event(base, SAADC_EVENTS_STOPPED, kSaadcStopSpinLimit)) {
        *regptr(base, SAADC_ENABLE) = SAADC_ENABLE_DISABLED;
        return -1;
    }

    *regptr(base, SAADC_ENABLE) = SAADC_ENABLE_DISABLED;

    if (*regptr(base, SAADC_RESULT_AMOUNT) < 2UL) {
        return -1;
    }

    int32_t value = (int32_t)g_saadc_sample;
    if (value < 0) {
        value = 0;
    }
    return (int)value;
}

static int saadc_sample_pin(uint8_t port, uint8_t pin, uint8_t resolution_bits)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    for (uint8_t attempt = 0U; attempt < kSaadcLowPowerAttempts; ++attempt) {
        if (attempt != 0U) {
            delayMicroseconds(kSaadcLowPowerRetrySettleUs);
        }

        const int value = saadc_sample_pin_once(port, pin, resolution_bits);
        if (value >= 0) {
            return value;
        }
    }
    return -1;
#else
    return saadc_sample_pin_once(port, pin, resolution_bits);
#endif
}

void analogReference(uint8_t mode)
{
    (void)mode;
}

void analogReadResolution(uint8_t bits)
{
    if (bits < 1U) {
        bits = 1U;
    }
    if (bits > 30U) {
        bits = 30U;
    }
    g_analog_read_resolution = bits;
}

void analogWriteResolution(uint8_t bits)
{
    if (bits < 1U) {
        bits = 1U;
    }
    if (bits > 16U) {
        bits = 16U;
    }
    g_analog_write_resolution = bits;
}

void analogWriteFrequency(uint32_t hz)
{
    if (hz == 0UL) {
        hz = ANALOG_PWM_DEFAULT_HZ;
    }

    uint8_t prescaler = 0U;
    uint16_t countertop = 0U;
    if (!pwm_compute_timing(hz, &prescaler, &countertop)) {
        return;
    }

    const uint16_t old_countertop = g_pwm_countertop;
    g_analog_write_frequency_hz = hz;
    g_pwm_prescaler = prescaler;
    g_pwm_countertop = countertop;
    g_soft_pwm_period_us = soft_pwm_period_us_for_frequency(hz);

    analog_write_recompute_active_outputs(old_countertop);
    for (uint8_t i = 0U; i < ANALOG_PWM_PIN_COUNT; ++i) {
        if (g_pwm_pin_used[i] == 0U ||
            g_pwm_pin_timer_slot[i] == ANALOG_PWM_NO_SLOT) {
            continue;
        }
        timer_pwm_apply_pin(i);
    }

    for (uint8_t instance = 0U; instance < ANALOG_PWM_INSTANCES; ++instance) {
        if (g_pwm_initialized[instance] != 0U ||
            pwm_instance_any_used_channel(instance) != 0U) {
            pwm_stop_instance(instance);
            if (pwm_instance_any_used_channel(instance) != 0U) {
                pwm_start_if_needed(instance);
            }
        }
    }

    nrf54l15_analog_write_idle_service();
}

static void analog_write_apply_pwm_pin(uint8_t pwm_pin)
{
    if (pwm_pin >= ANALOG_PWM_PIN_COUNT) {
        return;
    }

    const uint32_t pulse = g_pwm_pin_pulse[pwm_pin];

    if (pulse == 0U) {
        if (pwm_pin_requests_custom_frequency(pwm_pin) != 0U &&
            pwm_pin_supports_timer_output(pwm_pin) != 0U &&
            timer_pwm_hold_pin_static(pwm_pin, 0U) != 0U) {
            return;
        }
        g_pwm_pin_used[pwm_pin] = 0U;
        g_pwm_pin_software[pwm_pin] = 0U;
        timer_pwm_release_pin(pwm_pin);
        if (pwm_pin_can_use_hardware(pwm_pin) != 0U) {
            pwm_release_shared_output(pwm_pin);
        }
        g_soft_pwm_on_time_us[pwm_pin] = 0UL;
        {
            uint8_t port = 0U;
            uint8_t pin = 0U;
            if (resolve_pwm_gpio(pwm_pin, &port, &pin) != 0U) {
                gpio_write_raw(port, pin, 0U);
            }
        }
        return;
    }

    if (pulse >= (uint32_t)g_pwm_countertop) {
        if (pwm_pin_requests_custom_frequency(pwm_pin) != 0U &&
            pwm_pin_supports_timer_output(pwm_pin) != 0U &&
            timer_pwm_hold_pin_static(pwm_pin, 1U) != 0U) {
            return;
        }
        g_pwm_pin_used[pwm_pin] = 0U;
        g_pwm_pin_software[pwm_pin] = 0U;
        timer_pwm_release_pin(pwm_pin);
        if (pwm_pin_can_use_hardware(pwm_pin) != 0U) {
            pwm_release_shared_output(pwm_pin);
        }
        g_soft_pwm_on_time_us[pwm_pin] = 0UL;
        {
            uint8_t port = 0U;
            uint8_t pin = 0U;
            if (resolve_pwm_gpio(pwm_pin, &port, &pin) != 0U) {
                gpio_write_raw(port, pin, 1U);
            }
        }
        return;
    }

    if (pwm_pin_requests_custom_frequency(pwm_pin) != 0U) {
        pwm_release_shared_output(pwm_pin);
        if (timer_pwm_apply_pin(pwm_pin) != 0U) {
            return;
        }
    } else {
        timer_pwm_release_pin(pwm_pin);
    }

    if (pwm_pin_requests_custom_frequency(pwm_pin) == 0U &&
        pwm_pin_can_use_hardware(pwm_pin) != 0U) {
        const uint8_t instance = k_pwm_pin_desc[pwm_pin].pwm_instance;
        uint8_t channel = ANALOG_PWM_NO_CHANNEL;
        if (pwm_acquire_channel(pwm_pin, &channel) != 0U) {
            g_pwm_pin_software[pwm_pin] = 0U;
            g_soft_pwm_on_time_us[pwm_pin] = 0UL;
            // nRF54L15 uses bit 15 to select polarity. FallingEdge polarity
            // starts high and transitions low at COMPARE, which matches
            // Arduino's active-high analogWrite() semantics.
            g_pwm_sequence[instance][channel] =
                (uint16_t)(PWM_COMPARE_POLARITY_FALLING_EDGE | (pulse & 0x7FFFU));

            if (pwm_init_once(instance)) {
                pwm_apply_outputs(instance);
            }
            pwm_start_if_needed(instance);
            return;
        }
    }

    g_pwm_pin_software[pwm_pin] = 1U;
    soft_pwm_update_channel(pwm_pin);
    nrf54l15_analog_write_idle_service();
}

void analogWritePinFrequency(uint8_t pin, uint32_t hz)
{
    uint8_t pwm_pin = 0U;
    if (!pwm_pin_index_for_pin(pin, &pwm_pin)) {
        return;
    }

